{
  "projects": [
    {
      "id": 1,
      "name": "Проект для хакатона ВИХ-рь",
      "description": "Конструкторское бюро",
      "image": "/cad-front/public/assets/vihr.webp",
      "more": "Целью одной из команд проекта было проектирование оборудования по автоматическому изготовлению скруток из трубок в nanoCAD Механика PRO. За время участия ребятам удалось разработать сборный станок, состоящий из 7 узлов: разматывающее устройство, роликовый механизм, гильотина, конвейер, фаскосниматель, устройства для установки втулок и сматывания трубок.При участии во всероссийском инженерном хакатоне одной из команд была поставлена задача, разработать автоматический поточный контроль герметичности ПЭТ бутылок. В основе их задумки, первым делом, бутылки должны двигаться по конвейеру до системы проверки герметичности с радиальным расположением образцов. Далее захваты из системы перехватывают бутылки и путём сжатия, производится их проверка на герметичность. Для этого к каждому захвату устанавливается датчик контроля сжатия. В случае превышения стандартных показателей, бутылка отбраковывается и выводится из потока. Ребята успешно справились с поставленной задачей и достойно выступили на хакатоне.",
      "additional": "/cad-front/public/assets/botl.png",
      "linkedTeamId": "kb"
    },
    {
      "id": 2,
      "name": "Интерактивная виртуальная лабораторная работа для детей с нарушением опорно-двигательного аппарата в РОЦ №76",
      "description": "VR CONCEPT",
      "image": "/cad-front/public/assets/rocc.webp",
      "more": "Интерактивная виртуальная лабораторная работа для детей с нарушением опорно-двигательного аппарата в РОЦ №76. Для работы совместно с проектом “Студия анимации” были сделаны 3D-модели. После импортирования была собрана комната для проведения виртуального интерактивного урока. Всего было сделано больше 50 работ по предметам: физика, химия, биология.",
      "additional": "/cad-front/public/assets/rocc2.png",
      "linkedTeamId": "vr"
    },
    {
      "id": 3,
      "name": "Генератор муфт в nanoCAD",
      "description": "Разработка инженерного программного обеспечения",
      "image": "/cad-front/public/assets/genericmft.webp",
      "more": "Генератор муфт в nanoCAD — это инструмент для создания 3D-объектов в форме муфт. Он позволяет настраивать параметры, такие как диаметр, длина, тип соединения, толщина стенки и другие характеристики, формирующие геометрию муфты. Генератор муфт в nanoCAD может быть использован в различных инженерных и технических проектах, где требуются соединительные элементы. Стек технологий: C/C++, Qt, MFC, C#, WPF, nanoCAD, nanoCAD (SDK), nanoCAD Механика PRO, nanoCAD API(NRX, .NET)",
      "additional": "/cad-front/public/assets/muft.png",
      "linkedTeamId": "eng"
    },
    {
      "id": 4,
      "name": "Конфигуратор пневмопресса – интерактивное 3D-приложение для проектирования",
      "description": "C3D",
      "image": "/cad-front/public/assets/confpnevmo.webp",
      "more": "«Конфигуратор пневмопресса» — это приложение, позволяющее наглядно работать с электронной моделью пневматического пресса. Пользователь может изучать составные части конструкции, изменять параметры и взаимодействовать с 3D-моделью. Приложение включает систему классов для управления геометрией, основанную на C3D. Наследуемые структуры позволяют гибко конфигурировать модель, а детальная проработка механики делает процесс проектирования удобным и наглядным. Идеальный инструмент для инженеров, студентов и разработчиков САПР-систем            ",
      "additional": "/cad-front/public/assets/confpnevmo.webp",
      "linkedTeamId": "c3d"
    },
    {
      "id": 5,
      "name": "Генератор пружин в nanoCAD",
      "description": "Разработка инженерного программного обеспечения",
      "image": "/cad-front/public/assets/genericspring.webp",
      "more": "Генератор пружин в nanoCAD — это инструмент для создания 3D-объектов в форме пружин. Он позволяет настраивать параметры пружины, такие как диаметр, шаг, радиус и высоту, толщину проволоки, что формирует спиральную геометрию. Генератор пружин в nanoCAD может быть использован в различных инженерных и технических проектах, где требуются элементы с пружинной геометрией.",
      "additional": "/cad-front/public/assets/jump.png",
      "linkedTeamId": "eng"
    },
    {
      "id": 6,
      "name": "Mini CAD – первые шаги в мир 3D-моделирования",
      "description": "C3D",
      "image": "/cad-front/public/assets/minicad.webp",
      "more": "Mini CAD — это простое и увлекательное приложение для младших школьников, которое помогает освоить основы 3D-моделирования в САПР-системах. Через систему уровней дети шаг за шагом изучают создание и редактирование 3D-объектов, развивая пространственное мышление и инженерные навыки. Приложение делает обучение легким и интересным, превращая сложные технологии в игру. Mini CAD — идеальный старт для будущих инженеров и дизайнеров",
      "additional": "/cad-front/public/assets/minicad2.png",
      "linkedTeamId": "c3d"
    }
  ],
  "teams": [
    {
      "id": "eng",
      "logo": "eng.png",
      "name": "Разработка инженерного программного обеспечения",
      "description": "Проект «Разработка инженерного ПО» занимается созданием инструментов, позволяющих улучшать или дополнять отечественные САПР - nanoCAD и Компас-3D - тем самым упрощать работу конструкторов. Помимо этого, немаловажной задачей нашего проекта является подготовка студентов к работе с CAD системами, обучение и погружение в разработку инженерных продуктов, а также создание курсов, доступных широкой аудитории.",
      "projects": "Проекты: Генератор пружин в nanoCAD, Генератор муфт в nanoCAD, Генератор цепей в Компас-3D",
      "teamleader": "Team Leader - Старков Матвей",
      "additional": "engineerspo.webp",
      "members": "",
      "linkedProjectId": [3, 5]
    },
    {
      "id": "anim",
      "logo": "anim.png",
      "name": "Студия анимации",
      "description": "Инженерное программное обеспечение не предназначено для создания красивых визуализаций. Но рендер - то, по чему заказчик оценивает результат работы. Поэтому Студия анимации занимается анимированием готовых моделей, созданием моделей и анимаций любой сложности, а также подготовкой учебного материала по работе в Blender.",
      "projects": "Проекты: Анимация сокращения сердца разработана по заказу партнера проекта - школы ГБОУ РОЦ №76 для дальнейшего использования в образовательных целях в рамках учебной программы.",
      "teamleader": "Team Leader - Литвинов Леонид",
      "additional": "anistud.webp",
      "members": "Учебно-демонстрационная анимация Котик - создана участником проекта в ходе прохождения обучающего курса. Данный пример демонстрирует навыки владения костной анимацией, которые в дальнейшем участники проекта применяют в работе над реальными задачами.",
      "linkedProjectId": []
    },
    {
      "id": "vr",
      "logo": "vr.png",
      "name": "VR concept",
      "description": "Специализация — работа с платформой VR Concept: создание 3D-моделей в Blender, их интеграция в виртуальную среду и программирование функций на Python. Разрабатываем интерактивные решения, которые находят применение в различных сферах. Открыты для сотрудничества с партнёрами и новыми участниками, готовыми вместе исследовать возможности VR-технологий и создавать инновационные проекты.",
      "projects": "Проекты: Интерактивная виртуальная лабораторная работа для детей с нарушением опорно-двигательного аппарата в РОЦ №7",
      "teamleader": "Team Leader - Шаехова Ляйсан",
      "additional": "vr.webp",
      "members": "",
      "linkedProjectId": [2]
    },
    {
      "id": "c3d",
      "logo": "c3d.png",
      "name": "C3D",
      "description": "Мы разрабатываем программы на основе геометрического ядра C3D от C3D Labs и участвуем в хакатоне этой компании. Это не просто возможность прокачать скиллы в программировании и 3D-геометрии, но и реальный шанс попасть на стажировку в C3D Labs",
      "projects": "Проекты: Mini CAD, Конфигуратор пневмопресса",
      "teamleader": "Team Leader - Крянев Александр",
      "additional": "c3d.webp",
      "members": "",
      "linkedProjectId": [4, 6]
    },
    {
      "id": "kb",
      "logo": "kb.png",
      "name": "Конструкторское бюро",
      "description": "Основной проблематикой нашего проекта является сложность и трудность интеграции современных технологий в развитие систем автоматизированного проектирования. «Конструкторское бюро» предлагает различные варианты решений для развития действующих продуктов. Например, тестирование, анализирование эргономики САПР, разработка учебно-методических пособий, а также создание собственной конструкторской документации. Не мало важным аспектом нашей работы является участие во множестве конкурсов, турниров, олимпиад и хакатонов.",
      "projects": "Проекты: дигитайзер “MicroScribe MX Series Digitizer” для цифрового двойника, разработка цифрового двойника руки-манипулятора Robotics Kit YFROBOT, автоматический поточный контроль герметичности ПЭТ бутылок(хакатон ВИХ-рь)",
      "teamleader": "Team Leader - Кармовильцева Анна",
      "additional": "cb.webp",
      "members": "",
      "linkedProjectId": [1]
    },
    {
      "id": "scp",
      "logo": "scp.png",
      "name": "Цифровые прототипы",
      "description": "СЦП создает ИЭТР (интерактивное электронное техническое руководство) для упрощения обучения начинающих специалистов по работе с техническим оборудованием, требующим опыта работы с ним. Станки, 3д-принтеры, панели управления поездов требуют от их операторов высокого уровня навыков, дабы не допустить поломки или несчастного случая. Интерактивные инструкции позволяют работникам поработать с их будущим оборудования в специализированных программах, тем самым исключая риск происшествий из-за неправильной эксплуатации оборудования. Благодаря этому компании могут уменьшить количество несчастных случаев на производстве среди новых работников.",
      "projects": "Проекты: Интерактивная инструкция 3D принтера по металлу Farsoon FS273M и атласа продукции ТМХ",
      "teamleader": "Team Leader - Лукьянов Никита",
      "additional": "cp.webp",
      "members": "",
      "linkedProjectId": []
    }
  ],
  "subteams": [
    {
      "id": "eng",
      "header": "Разработка инженерного программного обеспечения",
      "subteams": [
        {
          "name": "Основная команда",
          "description": "Занимается созданием обучающих курсов и программных решений в рамках проектов САПРа. Основной партнёр — разработчики компании Нанософт, с которыми команда совместно создает контент и инструменты для инженерного образования."
        },
        {
          "name": "Подкоманда 'Веб'",
          "description": "Отвечает за проектирование и разработку веб-сайта, на котором представлены проекты САПРа. В задачи входит создание удобного интерфейса, обеспечение функциональности платформы для пользователей."
        }
      ]
    },
    {
      "id": "anim",
      "header": "Студия анимации",
      "subteams": [
        {
          "name": "Основная команда",
          "description": "Работает над курсом 'Компьютерная графика', предназначенным для ЛМС. В рамках курса разрабатываются обучающие материалы по Blender, ориентированные на студентов направления Разработка инженерного программного обеспечения."
        },
        {
          "name": "Подкоманда 'ЦАТ'",
          "description": "Создает 3D-модели оборудования, которые используются для разработки интерактивных инструкций по эксплуатации и обслуживанию принтеров. Эти инструкции адаптированы под нужды Цифровой Академии Транспорта."
        },
        {
          "name": "Подкоманда 'Образовательное моделирование'",
          "description": "Совместно с командой VR Concept разрабатывает 3D-модели и визуальный контент для виртуальных лабораторных работ, реализуемых в рамках программ дополнительного профессионального образования Сеченовского университета."
        }
      ]
    },
    {
      "id": "vr",
      "header": "VR Concept",
      "subteams": [
        {
          "name": "Основная команда",
          "description": "Создает образовательные решения с применением технологий виртуальной реальности. Основное направление — разработка интерактивных сценариев обучения для программы 'Разработчик решений виртуальной и дополненной реальности в медицине', реализуемой совместно с Сеченовским университетом."
        },
        {
          "name": "Подкоманда 'VR-Сценарии'",
          "description": "Разрабатывает интерактивные VR-сценарии обучения, включая симуляции, медицинские процедуры и тренажёры, которые интегрируются в образовательную платформу университета."
        },
        {
          "name": "Подкоманда 'Экспорт и интеграция'",
          "description": "Отвечает за экспорт 3D-моделей и анимаций из Blender и их последующую интеграцию в движок VR Concept. Также занимается технической оптимизацией контента для корректной работы в VR-среде."
        }
      ]
    },
    {
      "id": "kb",
      "header": "Конструкторское бюро",
      "subteams": [
        {
          "name": "Основная команда",
          "description": "Основная команда Конструкторского бюро отвечает за техническую основу всех инженерных решений в проектах САПРа. Одно из ключевых направлений работы — тестирование функционала платформы 'Механика PRO', в том числе проверка стабильности, выявление ошибок и предложение улучшений. Также команда занимается созданием точных 3D-сборок и компонентов, которые используются другими подразделениями, такими как Студия анимации и VR Concept. Важной частью работы является оформление полного пакета конструкторской документации — чертежей, спецификаций и сопроводительных материалов в соответствии с нормами ЕСКД. Благодаря своей экспертизе, Конструкторское бюро обеспечивает техническую достоверность, соответствие стандартам и высокое качество инженерного контента, используемого во всех этапах разработки."
        }
      ]
    },
    {
      "id": "c3d",
      "header": "C3D",
      "subteams": [
        {
          "name": "Основная команда",
          "description": "Ведет разработку программного обеспечения на основе геометрического ядра C3D от компании C3D Labs. Основная цель — создание инструментов для построения и редактирования 3D-моделей, применяемых в инженерных задачах. Также команда может заниматься интеграцией C3D с другими платформами, разработкой плагинов и пользовательских интерфейсов для взаимодействия с ядром, а также созданием прототипов новых CAD-решений."
        }
      ]
    },
    {
      "id": "scp",
      "header": "Цифровые прототипы",
      "subteams": [
        {
          "name": "Основная команда",
          "description": "Выполняет разнообразные проектные задачи — от создания интерактивных инструкций (например, по 3D-принтерам для ЦАТ) до подготовки методических материалов и исследования новых платформ для разработки контента. Также занимается адаптацией новичков в проекте, обучая их работе с движком Unigine и методикам создания цифровых прототипов."
        },
        {
          "name": "Подкоманда 'ТМХ'",
          "description": "Специализируется на выполнении проектных заданий, поступающих от компании Трансмашхолдинг (ТМХ). В рамках сотрудничества разрабатываются обучающие инструкции, визуализации и цифровые модели, которые соответствуют требованиям и техническим стандартам ТМХ."
        }
      ]
    }
  ]
}
